Tekla Open API Reference for Tekla Structures 2025
Grid.GridAttributes.DrawOnlyTextLabelsNotGrids Property
 Set as true if you don't want to draw the grids, only show the grids' text labels.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawOnlyTextLabelsNotGrids { get; set; }
Public Property DrawOnlyTextLabelsNotGrids As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Grid.GridAttributes Class
Tekla.Structures.Drawing Namespace